<!-- eslint-disable prettier/prettier -->
<!-- eslint-disable no-irregular-whitespace -->
<template>
  <div class="pa-5 scroll">
    000 주식회사(이하 “회사”)는 개인정보보호법 제30조에 따라 정보주체의 개인정보를 보호하고, 
    이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.<br /><br />
    <b>※ 개인정보 처리방침은 다음과 같은 내용을 담고 있습니다.</b> <br /><br />
    제1조(개인정보 처리목적)<br />
    제2조(개인정보 처리 및 보유기간)<br />
    제3조(처리하는 개인정보 항목)<br />
    제4조(개인정보의 제3자 제공)<br />
    제5조(개인정보 처리의 위탁)<br />
    제6조(정보주체의 권리·의무 및 행사방법)<br />
    제7조(개인정보의 파기)<br />
    제8조(개인정보의 안전성 확보조치)<br />
    제9조(개인정보 자동 수집 장치의 설치∙운영 및 거부에 관한 사항)<br />
    제10조(개인정보 보호책임자)<br />
    제11조(개인정보 열람청구)<br />
    제12조(권익침해 구제방법)<br />
    제13조(개인정보 처리방침 공개 및 변경)<br /><br />
    <b>제1조(개인정보 처리목적)</b> <br /><br />
    ①   회사는 다음의 목적을 위하여 개인정보를 수집·처리합니다.<br />
    처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는
    경우에는 개인정보보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다. <br /><br />
    1) 홈페이지 회원 가입 및 관리 <br />
    -회사는 법령에 따른 개인정보 보유·이용기간 또는 개인정보 수집 시에 동의받은 개인정보 보유·이용기간 또는 법령의 정함 내에서 개인정보를 처리·보유합니다. <br /><br />
    <b>제2조(개인정보 처리 및 보유기간)</b><br /><br />
    ①   회사는 법령에 따른 개인정보 보유·이용기간 또는 개인정보를 수집시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다. <br /><br />
    ②   각각의 개인정보 처리 및 보유 기간은 다음과 같습니다. <br /><br />
    1) 홈페이지 회원 가입 및 관리 : 사업자/단체 홈페이지 탈퇴시까지<br />
    다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지 <br />
    - 관계 법령 위반에 따른 수사, 조사 등이 진행중인 경우에는 해당 수사, 조사 종료시까지 <br />
    - 회사가 정한 미사용 기간을 초과할 경우, 해당 일자까지<br />
    · 미사용 기간: 1년 <br /><br />
    <b>제3조(처리하는 개인정보 항목)</b><br /><br />
    ①   회사는 다음의 개인정보 항목을 처리하고 있습니다. <br /><br />
    1)   홈페이지 회원 가입 및 관리 : 사업자/단체 홈페이지 탈퇴시까지 업체회원 탈퇴시까지<br />
    (단, 90일 이상 장기 미사용 시 계정 삭제 및 개인정보 파기)<br /><br />
    다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지 <br />
    - 관계 법령 위반에 따른 수사, 조사 등이 진행중인 경우에는 해당 수사, 조사 종료시까지<br />
    - 회사가 정한 미사용 기간을 초과할 경우, 해당 일자까지 · 미사용 기간: 1년 <br />
    - 통신비밀보호법」에 따른 통신사실확인자료 보관<br />
    - 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월 <br /><br />
    ②   인터넷 서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다.<br />
    - IP 주소, 쿠키, MAC주소, 서비스 이용기록, 방문기록, 불량 이용기록 등 <br /><br />
    <b>제5조(개인정보 처리의 위탁)</b> <br /><br />
    ①   회사는 원활한 개인정보 업무 처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
    위탁받는 자(수탁자) 위탁하는 업무의 내용 000 생산지원시스템 SRM, QMS, EMS IT시스템 운영 업무 000 생산지원시스템 SRM, QMS, EMS IT시스템 운영 업무 <br /><br />
    ②   회사는 위탁계약 체결 시 개인정보보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적 · 관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리 · 감독, 
    손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다. <br /><br />
    ③   위탁업무의 내용이나 수탁자가 변경될 경우에는 지체 없이 본 개인정보처리 방침을 통하여 공개하도록 하겠습니다. <br /><br />
    <b>제6조(정보주체의 권리 · 의무 및 행사방법)</b> <br /><br />
    ①   정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다. <br /><br />
    1)   개인정보 열람 요구 : My Info 메뉴를 통해 회원님은 언제든지 등록되어 있는 본인의 회원정보 조회하실 수 있습니다. <br />
    2)   오류 등이 있을 경우 정정 요구 : My Info 메뉴를 통해 회원님은 언제든지 등록되어 있는 본인의 회원정보 변경하실 수 있습니다. <br />
    3)   삭제 요구 : My Info > 회원탈퇴 메뉴를 통해 회원님은 언제든지 등록되어 있는 본인의 회원정보를 삭제하실 수 있습니다. <br />
    4)   처리정지 요구 : 이메일 주소로 메일전송을 통해 회원님은 언제든지 등록되어 있는 본인의 정보에 대해 처리정지를 요청 하실 수 있습니다. <br /><br />
    ②   제1항에 따른 권리 행사는 회사에 대해, 전자우편, 모사전송 (FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체 없이 조치합니다. <br /><br />
    ③   정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다. <br /><br />
    ④   제1항에 따른 권리 행사는 정보주체의 위임을 받은 자 등 법정대리인을 통하여 할 수 있습니다.
    이 경우 개인정보 처리 방법에 관한 고시(제2020-7호) 별지 제11호 서식에 따른 위임장을 제출하여야 합니다. <br /><br />
    ⑤   정보주체는 개인정보보호법 등 관계법령을 위반하여, 회사가 처리하고 있는 타인의 개인정보 및 사생활을 침해하여서는 안됩니다. <br /><br />
    <b>제7조(개인정보의 파기)</b> <br /><br />
    ①    회사는 수집한 개인정보의 이용목적이 달성되거나 , 서비스 회원을 탈퇴할 경우 당해 회원님의
    개인정보를 다음 각호의 방법으로 지체 없이 파기하여 향후 어떠한 용도로도 열람
    또는 이용할 수 없도록 처리하고 있습니다. <br /><br />
    1)    종이에 출력된 개인정보 : 분쇄기로 분쇄, 소각 또는 용해 <br />
    2)    전자적 파일 형태로 저장된 개인정보 : 복구 불가능한 기술적 방법으로 삭제 <br /><br />
    <b>제8조(개인정보의 안전성 확보조치)</b> <br /><br />
    ①     회사는 개인정보를 처리함에 있어 개인정보가 분실 · 도난 · 유출 · 변조 또는
    훼손되지 않도록 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다. <br /><br />
    1)    관리적 조치 : 내부관리계획 수립 · 시행, 정기적 직원 교육,개인정보보호 서약서 징구 등 <br />
    2)    기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화,
    보안프로그램 설치 <br />
    3)    물리적 조치 : 전산실,자료보관실 등의 접근통제 <br /><br />
    ②     회사는 개인정보의 유출 · 훼손 등 개인정보 침해사고 발생 시 지체없이
    정보주체에게 알리고 그 피해를 최소화 하기 위해 필요한 조치를 다합니다. <br /><br />
    <b>제9조(개인정보 자동 수집 장치의 설치∙운영 및 거부에 관한 사항)</b> <br /><br />
    ①    회사는 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로
    불러오는 ‘쿠키(cookie)’를 사용합니다. <br /><br />
    ②   쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저 에게 보내는 소량의 정보이며
    이용자들의 PC 컴퓨터 내의 하드디스크에 저장되기도 합니다. <br /><br />
    1)    쿠키의 사용목적: 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및
    이용형태,인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보
    제공을 위해 사용됩니다. <br />
    2)    쿠키의 설치∙운영 및 거부: 웹브라우저 상단의 도구 > 인터넷 옵션 > 개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다. <br />
    3)    쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다. <br /><br />
    <b>제10조(개인정보 보호책임자)</b> <br /><br />
    ①   회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및
    피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.<br />
    회사 구분 개인정보 보호책임자 개인정보 보호담당자 000 소속 정보보호담당
    Global제조IT Unit 성명/직급 000 / 00 000 / 00 연락수단 (메일) (메일) (전화) <br /><br />
    ②   정보주체 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을
    개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다.회사는 정보주체의
    문의에 대해 지체 없이 처리합니다. <br /><br />
    <b>제11조(개인정보 열람청구)</b><br /><br />
    정보주체는 개인정보보호법 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다. <br />
    구분 개인정보 열람청구 접수 · 처리 부서 부서명 담당자 000 연락처 이메일 <br /><br />
    <b>제12조(권익침해 구제방법)</b><br /><br />
    정보주체는 아래의 기관에 대해 개인정보 침해에 대한 피해구제, 상담 등을 할 수 있습니다 . <br /><br />
    ▶ 개인정보 침해신고센터 :
    (국번없이)118  privacy.kisa.or.kr <br /><br />
    ▶ 개인정보 분쟁조정위원회 : 1833-6972 
    kopico.go.kr <br /><br />
    ▶ 대검찰청 사이버수사과 : (국번없이)1301, cid@spo.go.kr  
    spo.go.kr <br /><br />
    ▶ 경찰청 사이버수사국 : (국번없이)182 ecrm.cyber.go.kr <br /><br />
    <b>제13조(개인정보 처리방침 공개 및 변경)</b> <br /><br />
    ①   이 개인정보 처리방침은  2022 년 06월 08일에 제(개)정되었으며 법령/정책 또는 보안기술의 변경에 따라 내용의
    추가, 삭제 및 수정이 있을 시에는 변경되는 개인정보 처리방침을 시행하기 최소
    7일전에 홈페이지를 통해 변경 이유 및 내용 등을 공지합니다. <br /><br />
    ②   단, 개인정보의 제3자 제공, 수집·이용목적 변경, 보유기간 변경 등 중요한 사항이
    변경되는 경우에는 정보주체의 동의를 얻습니다.
  </div>
</template>
<script>
import _ from "lodash";
import { mapMutations, mapState } from "vuex";
export default {
  data() {
    return {
      paramProps: {},
      open: false,
      callback: "",
    };
  },
  computed: {
    ...mapState("modal", [
      "param",
      "height",
      "dialogTitle",
      "dialogText",
      "maxWidth",
      "closable",
      "customApprove",
      "approveName",
    ]),
  },
  methods: {
    ...mapMutations("modal", ["RESET_MODAL"]),
    openModal(cb) {
      this.open = true;
      this.callback = cb;
    },
    closeModal() {
      this.open = false;
      this.RESET_MODAL();
    },
    onApprove() {
      this.closeModal();
      if (_.isFunction(this.callback)) {
        this.callback();
      }
    },
  },
  components: {},
};
</script>
<style>
.approve span {
  color: white;
}

.tableParent {
  border-collapse: collapse;
  display: table;
}

.tableChild {
  display: table-row;
  vertical-align: bottom;
  height: 1px;
}

.scroll {
  max-height: 500px;
  overflow: auto;
}
</style>
